Revit 2025 API
AnalysisDisplayColoredSurfaceSettings Class
 Contains colored surface settings for analysis display style element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class AnalysisDisplayColoredSurfaceSettings : IDisposable
Public Class AnalysisDisplayColoredSurfaceSettings
	Implements IDisposable
public ref class AnalysisDisplayColoredSurfaceSettings : IDisposable
type AnalysisDisplayColoredSurfaceSettings =
    class
        interface IDisposable
    end
The AnalysisDisplayColoredSurfaceSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayColoredSurfaceSettings() |  Constructs a default instance of colored surface settings.
AnalysisDisplayColoredSurfaceSettings(AnalysisDisplayColoredSurfaceSettings) |  Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object.
Top
Properties
Name | Description
GridColor |  Color of grid lines.
GridLineWeight |  Line weight of grid lines.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ShowContourLines |  If true, show contour lines in the analysis display.
ShowGridLines |  If true, show grid lines in the analysis display.
Transparency |  Transparency percentage of colored surface
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalysisDisplayColoredSurfaceSettings
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Compares two colored surface settings objects.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Example
AnalysisDisplayColoredSurfaceSettings coloredSurfaceSettings = new AnalysisDisplayColoredSurfaceSettings();
coloredSurfaceSettings.ShowGridLines = true;
Dim coloredSurfaceSettings As New AnalysisDisplayColoredSurfaceSettings()
coloredSurfaceSettings.ShowGridLines = True
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace